/*
Description
人之初 性本善 性相近 习相远 苟不教 性乃迁 教之道 贵以专 昔孟母 择邻处 子不学 断机杼 
窦燕山 有义方 教五子 名俱扬 养不教 父之过 教不严 师之惰 子不学 非所宜 幼不学 老何为 
玉不琢 不成器 人不学 不知义 为人子 方少时 亲师友 习礼仪 香九龄 能温席 孝于亲 所当执 
融四岁 能让梨 弟于长 宜先知 首孝弟 次见闻 知某数 识某文 一而十 十而百 百而千 千而万
上面给出了三字经的前24句（每6字算1句，分上下句） 现在我说上句，你答下句，或是我说下句，你答上句。
Input
若干行,每行有1个问题，以“三字经”结束
Output
回答上句或下句，没有时回答“别逗了”，最后的“三字经”不用回答
Sample Input
人之初
习相远
高富帅
白富美
三字经
Sample Output
性本善
性相近
别逗了
别逗了
*/
#include<stdio.h>
#include<string.h>
char Three[48][10]={"人之初","性本善","性相近","习相远","苟不教","性乃迁","教之道","贵以专","昔孟母","择邻处","子不学","断机杼",
"窦燕山","有义方","教五子","名俱扬","养不教","父之过","教不严","师之惰","子不学","非所宜","幼不学","老何为",
"玉不琢","不成器","人不学","不知义","为人子","方少时","亲师友","习礼仪","香九龄","能温席","孝于亲","所当执",
"融四岁","能让梨","弟于长","宜先知","首孝弟","次见闻","知某数","识某文","一而十","十而百","百而千","千而万"};
int main(int argc, char const *argv[])
{
    char input[10];
    int a;
    int find;//找到了就为1，没找到就是0

    gets(input);
    while(strcmp(input,"三字经")!=0)
    {
        for(a=0,find=0;a<48;a++)
            if(strcmp(input,Three[a])==0)
            {
                find=1;//找到了赋值1
                if((a+1)%2==0)//判断奇偶
                    puts(Three[--a]);
                else
                    puts(Three[++a]);
                break;
            }
        if(find==0)//如果没找到
            puts("别逗了");
        gets(input);
    }
    //断点
    return 0;
}
